andenetalexander.vim-cheatsheet
angular.ng-template
bierner.markdown-mermaid
dbaeumer.vscode-eslint
eamodio.gitlens
editorconfig.editorconfig
esbenp.prettier-vscode
github.copilot
github.copilot-chat
hashicorp.terraform
johnpapa.angular2
moshfeu.compare-folders
ms-azure-devops.azure-pipelines
ms-azuretools.vscode-azure-github-copilot
ms-azuretools.vscode-azureresourcegroups
ms-azuretools.vscode-docker
ms-dotnettools.csdevkit
ms-dotnettools.csharp
ms-dotnettools.vscode-dotnet-runtime
ms-mssql.data-workspace-vscode
ms-mssql.mssql
ms-mssql.sql-bindings-vscode
ms-vscode-remote.remote-containers
ms-vscode-remote.remote-wsl
ms-vscode.powershell
pkief.material-icon-theme
pomber.git-file-history
rvest.vs-code-prettier-eslint
tombonnike.vscode-status-bar-format-toggle
vscodevim.vim
zhuangtongfa.material-theme
