bierner.markdown-mermaid
catppuccin.catppuccin-vsc
cucumberopen.cucumber-official
dbaeumer.vscode-eslint
editorconfig.editorconfig
esbenp.prettier-vscode
github.copilot
github.copilot-chat
hashicorp.terraform
jetbrains.resharper-code
ms-dotnettools.csdevkit
ms-dotnettools.csharp
ms-dotnettools.vscode-dotnet-runtime
ms-mssql.mssql
ms-vscode-remote.remote-containers
ms-vscode-remote.remote-wsl
pkief.material-icon-theme
